FROM python:3.11-slim-buster

WORKDIR /app

# Сначала копируем файл с зависимостями
# Это отдельный шаг, чтобы Docker мог закэшировать установку зависимостей
# и не делал это заново при каждом изменении кода
COPY requirements.txt requirements.txt

# Устанавливаем все зависимости, указанные в requirements.txt
RUN pip install -r requirements.txt

# Копируем весь остальной код проекта в рабочую директорию контейнера
COPY . .

# "Открываем" порт 5000 для внешнего мира
# (Тот самый порт, который слушает Flask по умолчанию)
EXPOSE 5000

# Команда для запуска приложения при старте контейнера
CMD ["python", "app.py"]